In [1]:
import pandas as pd

In [2]:
def mytabla(data):
    nulls = pd.DataFrame(data.isnull().sum()/data.shape[0]*100, columns=['% de datos nulos'])
    ceros = pd.DataFrame((data==0).sum()/data.shape[0]*100, columns=['% de ceros'])
    tipo = pd.DataFrame(data.dtypes,columns=['Tipo de datos'])
    val = pd.DataFrame(data.nunique(),columns=['# de valores diferentes'])
    mis_val_table = pd.concat([nulls, ceros,tipo, val], axis=1)
    return mis_val_table

In [5]:
name = r"C:\Users\jibar\OneDrive - Universidad de los andes\Clases_Maestria\CIENCIA DE DATOS\Proyecto\General\General\Data\CurrentDay.csv"

data =pd.read_csv(name,sep='|',error_bad_lines=False, warn_bad_lines= False,index_col=False,header=0, low_memory=False)

In [6]:
mytabla(data)

,% de datos nulos,% de ceros,Tipo de datos,# de valores diferentes
id_sitio,0.0,0.0,int64,299
CD_Timestamp,0.0,0.0,object,5922080
CD_Value,0.0,0.0,object,1316266

In [8]:
data.shape

(7445961, 3)

In [10]:
data.head()

   id_sitio         CD_Timestamp            CD_Value
0         2  2014-10-20 15:15:52             1101,74
1         3  2014-10-20 16:29:49  550,67999999999995
2         4  2014-10-20 16:22:12  4581,0500000000002
3         5  2014-10-20 17:57:09  9850,8199999999997
4         6  2014-10-20 17:56:08  623,03999999999996

In [13]:
def eliminar_coma(x):
    x=str(x).replace(',','.')
    return x

In [14]:
data['id_sitio']=data['id_sitio'].astype('object')

data['CD_Value']=data['CD_Value'].apply(eliminar_coma)
data['CD_Value']=data['CD_Value'].astype(float)

In [15]:
mytabla(data)

,% de datos nulos,% de ceros,Tipo de datos,# de valores diferentes
id_sitio,0.0,0.000000,object,299
CD_Timestamp,0.0,0.000000,object,5922080
CD_Value,0.0,7.102038,float64,1316266

In [16]:
data.select_dtypes(['O']).describe()

        id_sitio         CD_Timestamp
count    7445961              7445961
unique       299              5922080
top           20  2015-10-06 06:48:40
freq       28443                  531

In [17]:
data.select_dtypes(['float']).describe()

           CD_Value
count  7.445961e+06
mean   4.704127e+03
std    2.063853e+04
min   -2.881764e+06
25%    2.465700e+02
50%    1.069410e+03
75%    3.446000e+03
max    8.821828e+06